Revit 2027 API
OptionalFunctionalityUtils.IsGraphicsAvailable Method
 Checks whether the graphics functionality is available to support display, print, and export functionality.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsGraphicsAvailable()
Public Shared Function IsGraphicsAvailable As Boolean
public:
static bool IsGraphicsAvailable()
static member IsGraphicsAvailable : unit -> bool
Return Value
Boolean
 True if the Graphics functionality is available in the installed Revit.
Remarks
 Graphics functionality is optional functionality that does not have to be part of the Revit installation.
See Also
Reference
OptionalFunctionalityUtils Class
Autodesk.Revit.DB Namespace